[
  {
    "text": "This entry, from Culter School, describes what happened when the air raid sirens blew their warning. \n\"An air raid warning by siren was sounded about 3.50 this afternoon.  The pupils were immediately dispersed either to their homes or to houses in the vicinity of the school.  After the \"all clear\", about 4.15, the children returned to school for their belongings and were dismissed.\"\n\n\n© Aberdeen City and Aberdeenshire Archives", 
    "image": "http://www.aberdeencity.gov.uk/web/MultimediaFiles/CULTER_SCHOOL_LOGBOOK3P241_AIRRAIDWARNING.JPG", 
    "copyright": "\\u00a9 Aberdeen City and Aberdeenshire Archives"
  }, 
  {
    "text": "Peterhead Academy was badly affected by air raids, as this entry from September 1940 shows.  Having been closed over the summer holidays, the building was damaged during an air raid but was due to re-open on 19 August.  These plans suffered a set back, however, as the headmaster records.\n\n                \"New session begins.  The opening date was to have been August 19th, but on the 12th of July at 3am three enemy bombs fell on and near the main Academy buildings.  The chief damage was done to the Domestic Science and Science Departments and to Rooms 10, 11.  The opening date was then advertised for the 9th Sept., but again on 22nd August an enemy bomb fell almost exactly where a previous bomb had formed a crater: two other bombs falling quite near.  The effect of the blast of these bombs was to again break almost all the windows (previously re-glazed) and the gymnasium and woodwork block suffered considerably also.\n                It was decided that the Academy could not meet unless in other accommodation.  After making suitable enquiries I have secured 10 rooms of the North School, and 2 rooms each in the Public Library, the Court House, East, West Associate, Old Parish and one room in the Baptist Church.\n                Country pupils are catered for in the mornings.  All pupils are receiving about 3 hr instruction daily in groups of approximately 15.\"\n\n\n© Aberdeen City and Aberdeenshire Archives", 
    "image": "http://www.aberdeencity.gov.uk/web/MultimediaFiles/PETERHEADACADEMY_LOGBOOK4P38AND39_BOMBING.JPG", 
    "copyright": "\\u00a9 Aberdeen City and Aberdeenshire Archives"
  }, 
  {
    "text": "There are many entries in the log book for Fraserburgh Central School regarding the war.  The following entries show the wider impact air raids were having on the town which in turn had an effect on the school.\nThis entry, from 19 August 1940 shows how parents were reacting to the air raids, and were questioning the apparent safety precautions in place at the Central School.\n\"School re-opened today.  Only 20 pupils present as parents have declared that they will not send their children to school until proper air-raid shelters are provided.  Dismissed pupils, stating that school would open again in the afternoon.  In the afternoon, only 4 pupils present.  Dismissed pupils after marking registers.  Teachers remained in school and made up new registers.\"\nThe headteacher goes on to record that there were no pupils present for the rest of that week.\n\n\n© Aberdeen City and Aberdeenshire Archives", 
    "image": "http://www.aberdeencity.gov.uk/web/MultimediaFiles/FRASERBURGHCENTRAL_LOGBOOK3P253_AIRRAIDSHELTERS.JPG", 
    "copyright": "\\u00a9 Aberdeen City and Aberdeenshire Archives"
  }, 
  {
    "text": "Though it is not noted in Fraserburgh Academy's log book of the same date that there were issues with the quality of air raid shelters provided there, the following entry confirms the fear the air raids were causing throughout the town.  It also mentions netting which was stuck to the windows to help prevent shattered glass spreading into classrooms in the event of a raid. \n\"School reopened.  Very poor attendance owing to fear of air-raids.  Only about 40 pupils present of classes VI, V, IV, Ic, 3LI.  These classes attended from the opening date except on Aug 26 when the school was closed while anti-splinter netting was fixed on the windows.\n\n\n© Aberdeen City and Aberdeenshire Archives", 
    "image": "http://www.aberdeencity.gov.uk/web/MultimediaFiles/FRASERBURGHACADEMY_LOGBOOK2P157_AIRRAIDS.JPG", 
    "copyright": "\\u00a9 Aberdeen City and Aberdeenshire Archives"
  }, 
  {
    "text": "This entry regarding the attack on Fraserburgh in November 1940 tells us \"School did not open.  Very few pupils turned up and these were sent home.  The town was heavily bombed during the night and about 40 killed.\"\n\n\n\n© Aberdeen City and Aberdeenshire Archives", 
    "image": "http://www.aberdeencity.gov.uk/web/MultimediaFiles/FRASERBURGHACADEMY_LOGBOOK2P160_BOMBING.JPG", 
    "copyright": "\\u00a9 Aberdeen City and Aberdeenshire Archives"
  }, 
  {
    "text": "The above entry gives the bare facts about what happened in Fraserburgh on the night of 5 November 1940 but further information can be gleaned from the entry recorded in the log book of Fraserburgh Central School.  The headteacher records \"On Monday afternoon the air-raid warning was sounded at 1.40, and there was no more school that day.  There was no school on Wednesday, as during a great fire in which Benzie & Miller's shop was completely destroyed the previous evening there was an air raid in which over 30 people were killed.  Hardly any children came next day.\"\n\n\n© Aberdeen City and Aberdeenshire Archives\nThe fire at Benzie & Miller's was an event in itself, but as it attracted Fraserburgh residents, so too did it attract the attention of enemy bombers.  Many of those killed in that raid were in the Commercial Bar at the top of Kirk Brae, not far from Benzie & Miller's store in Mid Street.  The bar was completely destroyed, with Peter O'Hara the landlord and his wife being among those killed.", 
    "image": "http://www.aberdeencity.gov.uk/web/MultimediaFiles/FRASERBURGHCENTRAL_LOGBOOK3P257_BOMBING.JPG", 
    "copyright": "\\u00a9 Aberdeen City and Aberdeenshire Archives"
  }, 
  {
    "text": "The entries in the Fraserburgh Central School log book contain flashes of how difficult - and dangerous - life could be in Fraserburgh during the war period.  In these next four entries, the effect of air raids on the town is vividly shown.\n\"Feb. 7 [1941].  On Friday about noon an enemy bomber dropped bombs on the town and machine-gunned people in the streets.  The pupils were put into their shelters, and sent home as soon as the 'plane had passed over the town.  No school in the afternoon as parents were afraid to let their children out.\" \n\n\n                   \n© Aberdeen City and Aberdeenshire Archives\n\"1941, June 26th.  Bombs dropped at 2am.  Wide damage caused by stones etc being thrown great distance.  Large stones fell in school playground, schoolhouse garden & in front of school.  Miss Cranna absent - suffering from shock, her house being one of those severely damaged.  Number of pupils absent.\"\n\n\n                   \n© Aberdeen City and Aberdeenshire Archives\n\"Enemy planes overhead today at 12.45 - bombing & machine-gunning.  Pupils kept in corridors.  \"Alarm\" went at 12.55 and \"all-clear\" at 1.10pm.  School resumed at 1.20, but a further \"alarm\" went at 1.30pm.  \"All clear\".\n                  \n\n\n                   \n© Aberdeen City and Aberdeenshire Archives\n\"22nd.  Bombing on Saty [Saturday] morning at 2.50am.  One pupil of school killed.  Many windows on East & South sides broken.  \"First aid\" repairs carried out on Sunday & school reopened as usual on Monday.\"\n\n\n                   \n© Aberdeen City and Aberdeenshire Archives", 
    "image": "http://www.aberdeencity.gov.uk/web/MultimediaFiles/FRASERBURGHCENTRAL_LOGBOOK3P260_BOMBING.JPG", 
    "copyright": "\\u00a9 Aberdeen City and Aberdeenshire Archives"
  }, 
  {
    "text": "Sunnybank School was one of a number of schools to be damaged in the air raid.  Devastatingly, it was also situated in a residential area which saw a large amount of damage.  The headteacher records the aftermath as follows:\n\"Owing to extensive damage to the windows on the south (rear) side of school, caused by enemy aerial action last night, the school is not opened except to provide the mid-day meal.  Extensive damage has been done in the school area, especially in Bedford Road, and in Elmbank Road where whole houses have been demolished and it is feared quite a number of adult and child casualties.  Many scholars have not appeared for dinner, and a number of bombed-out people have been asked in for meals.\"\n\n\n© Aberdeen City and Aberdeenshire Archives", 
    "image": "http://www.aberdeencity.gov.uk/web/MultimediaFiles/SUNNYBANKSCHOOL_LOGBOOK2P142_APRIL1943.JPG", 
    "copyright": "\\u00a9 Aberdeen City and Aberdeenshire Archives"
  }, 
  {
    "text": "The following week continued to be disrupted as a result of the raid on the night of 21 April 1943 as the headmaster records.  Normal opening hours were not kept for almost a week, and there were a large number of absentees.  In this rather sobering account, the human tragedy is also noted.\n\"27.4.43.  100 absentees again in the Sunnybank School buildings.  Five scholars belonging to the school (three boys and two girls) are said to have been killed - another 'double attendance marked'.\"\n\n\n© Aberdeen City and Aberdeenshire Archives", 
    "image": "http://www.aberdeencity.gov.uk/web/MultimediaFiles/SUNNYBANKSCHOOL_LOGBOOK2P142_AIRRAID.JPG", 
    "copyright": "\\u00a9 Aberdeen City and Aberdeenshire Archives"
  }, 
  {
    "text": "It was not known at the time that the heaviest raid was to be Aberdeen's last, as this entry shows, nor was the threat from gas attacks waning.  Some were taking no chances and leaving the city.  This had an impact on attendance figures at Sunnybank, as the headteacher notes.\n\"30.4.43.  Teachers inspect the scholars' gas-masks this afternoon - a poor attendance this week owing to afore-mentioned enemy aerial action.  A number of families have been evacuated, and seventeen pupils have left.  Infants 84.5%; Juniors 86.9%; Seniors 90.3%.  Total School 87.8%.  Roll 1,018.\"\n\n\n© Aberdeen City and Aberdeenshire Archives", 
    "image": "http://www.aberdeencity.gov.uk/web/MultimediaFiles/SUNNYBANKSCHOOL_LOGBOOK2P143_AIRRAIDREACTION.JPG", 
    "copyright": "\\u00a9 Aberdeen City and Aberdeenshire Archives"
  }, 
  {
    "text": "\"April 22.  Two direct hits by high explosive bombs & one by a phosphorous bomb from enemy aircraft flying at low level wrecked the school at 10.40pm on April 21st.  Miss Spicer who was on fire-watching duty, sustained severe injuries which have since resulted in the amputation of one of her legs; the other has a compound fracture.  The other fire-watchers, Misses MacOwan, Ettles, Myles & Mr Ross escaped unhurt.\"\n\n\n© Aberdeen City and Aberdeenshire Archives\n\n                A few days later, on 4 May 1943 the headteacher records \"Miss Spicer, I am pleased to report, is making satisfactory progress at Stracathro Hospital, Brechin, to which she was transferred lately from Aberdeen Royal Infirmary, Foresterhill.\"\n\n\n© Aberdeen City and Aberdeenshire Archives\n\n                By 1 September 1943 it is noted that \"Miss Spicer made good progress at Stracathro Hospital and has been removed to Eden Hall, Musselburgh for fitting of an artificial limb.  No praise is too high for the bravery & spirit shown by Miss Spicer throughout her ordeal and convalescence.\"\n\n\n© Aberdeen City and Aberdeenshire Archives\n\n                By June 1944, the headmaster is pleased to record that \"Miss Spicer returned to duty after her unfortunate injury on April 21st of last year.  She has been fitted with an artificial limb which enables her to walk fairly well.\"\n\n\n© Aberdeen City and Aberdeenshire Archives", 
    "image": "http://www.aberdeencity.gov.uk/web/MultimediaFiles/MIDDLEFIELDSCHOOL_LOGBOOK1P88AND89_21APRIL1943.JPG", 
    "copyright": "\\u00a9 Aberdeen City and Aberdeenshire Archives"
  }
]
